[{"id": "2hop__546800_262512", "pid": "2hop__546800_262512", "input": "You are given several paragraphs from Wikipedia and a question. Answer the question as concisely as you can, using a single phrase if possible. If the question cannot be answered based on the information in the paragraphs, write \"unanswerable\".\n\nParagraphs:\nTitle: Will to Love\n\"Will to Love\" is a song written by Neil Young that was first released on his 1977 album \"American Stars 'N Bars\". A promotional single of \"Will to Love\" was released, backed with a live performance of \"Cortez the Killer.\"\n\nTitle: Why Women Love\nWhy Women Love (also known as Sea Woman) is a 1925 American silent drama film produced and directed by Edwin Carewe and distributed by First National Pictures. Blanche Sweet starred in the film which was based on the Broadway play \"The Sea Woman\", by Willard Robertson. The film is now considered lost.\n\nTitle: All I Want for Christmas Is You\n``All I Want for Christmas Is You ''is a Christmas song performed by American singer and songwriter Mariah Carey. She wrote and produced the song alongside Walter Afanasieff. Columbia Records released it on November 1, 1994, as the lead single from her fourth studio album and first holiday album, Merry Christmas (1994). It is an uptempo love song that includes bell chimes, heavy back - up vocals, and synthesizers.\n\nTitle: List of Rebelde characters\nIn season three, Celina meets and falls in love with Max, who in turn becomes enamored with her. They later consummate their relationship, resulting in Celina getting pregnant. Max accepts it and says he will be a responsible father because he loves Celina. Only Celina's father accepts her pregnancy with Max and her mother disowns her.\n\nTitle: A Man Without Love\n``A Man Without Love ''was the British entry in the Eurovision Song Contest 1966, performed in English by Kenneth McKellar.\n\nTitle: Annabel Lee\nThe poem's narrator describes his love for Annabel Lee, which began many years ago in a ``kingdom by the sea ''. Though they were young, their love for one another burned with such an intensity that angels became envious. It is for that reason that the narrator believes the seraphim caused her death. Even so, their love is strong enough that it extends beyond the grave and the narrator believes their two souls are still entwined. Every night, he dreams of Annabel Lee and sees the brightness of her eyes in the stars. Every night he lies down by her side in her tomb by the sea.\n\nTitle: The Sea Lion\nThe Sea Lion is a 1921 American silent adventure film directed by Rowland V. Lee, and starring Hobart Bosworth, Bessie Love, and Emory Johnson. The same staff on this film produced Rowland Lee's previous directed film \"Blind Hearts\", released just before \"The Sea Lion\".\n\nTitle: Loverman\n\"Loverman\" is the second single from the album \"Let Love In\" by Australian rock band Nick Cave and the Bad Seeds. The song was also performed by American heavy metal band Metallica on their 1998 cover album \"Garage Inc.\", Depeche Mode's Martin Gore in his 2003 solo album \"Counterfeit²\", and American jazz saxophonist Teodross Avery.\n\nTitle: Shout at the Devil\nShout at the Devil is the second studio album by American heavy metal band Mötley Crüe, released on September 26, 1983. It was the band's breakthrough album, establishing Mötley Crüe as one of the top selling heavy metal acts of the 1980s. The singles \"Looks That Kill\" and \"Too Young to Fall in Love\" were moderate hits for the band.\n\nTitle: Battle of Baltimore\nThe Battle of Baltimore was a sea/land battle fought between British invaders and American defenders in the War of 1812. American forces repulsed sea and land invasions off the busy port city of Baltimore, Maryland, and killed the commander of the invading British forces. The British and Americans first met at the Battle of North Point. Though the Americans retreated, the battle was a successful delaying action that inflicted heavy casualties on the British, halting their advance consequently allowing the defenders at Baltimore to properly prepare for an attack.\n\nTitle: Wasting Love\n\"Wasting Love\" is a song by the English heavy metal band Iron Maiden. It is the third single from their ninth studio album, \"Fear of the Dark\", released in 1992.\n\nTitle: Heavy Traffic (soundtrack)\nHeavy Traffic OST is the soundtrack to Ralph Bakshi's 1973 film \"Heavy Traffic\". The film's score was performed by Ed Bogas and Ray Shanklin. The soundtrack album was released on Fantasy Records in 1973. The album was released on compact disc in 1996 as part of a compilation that featured both the soundtracks to \"Fritz the Cat\" and \"Heavy Traffic\" on the same disc.\n\nTitle: Journey 2: The Mysterious Island\nVanessa Hudgens as Kailani Laguatan Gabato's daughter whom Sean falls in love with and who is part of the father - daughter tour guide team.\n\nTitle: ARA Almirante Brown (C-1)\nAlmirante Brown was a heavy cruiser in service with the Argentine Navy during the Second World war. The ship was named in honour of Admiral Guillermo Brown, the Father of the Argentine Navy.\n\nTitle: Platonic love\nThe English term dates back to William Davenant's The Platonic Lovers (performed in 1635); a critique of the philosophy of platonic love which was popular at Charles I's court. It is derived from the concept in Plato's Symposium of the love of the idea of good which lies at the root of all virtue and truth. For a brief period, Platonic love was a fashionable subject at the English royal court, especially in the circle around Queen Henrietta Maria, the wife of King Charles I. Platonic love was the theme of some of the courtly masques performed in the Caroline era -- though the fashion soon waned under pressures of social and political change.\n\nTitle: Beyoncé\nBeyoncé Giselle Knowles - Carter (/ biːˈjɒnseɪ /; born September 4, 1981) is an American singer, songwriter, performer, and actress. Born and raised in Houston, Texas, Beyoncé performed in various singing and dancing competitions as a child. She rose to fame in the late 1990s as lead singer of the R&B girl - group Destiny's Child. Managed by her father, Mathew Knowles, the group became one of the world's best - selling girl groups in history. Their hiatus saw Beyoncé's theatrical film debut in Austin Powers in Goldmember (2002) and the release of her debut album, Dangerously in Love (2003). The album established her as a solo artist worldwide, debuting at number one on the US Billboard 200 chart and earning five Grammy Awards, and featured the Billboard Hot 100 number one singles ``Crazy in Love ''and`` Baby Boy''.\n\nTitle: Marshall Islands\nIn 2008, extreme waves and high tides caused widespread flooding in the capital city of Majuro and other urban centres, 3 feet (0.91 m) above sea level. On Christmas morning in 2008, the government declared a state of emergency. In 2013, heavy waves once again breached the city walls of Majuro.\n\nTitle: All I Want for Christmas Is You\n``All I Want for Christmas Is You ''is a Christmas song performed by American singer and songwriter Mariah Carey. She wrote and produced the song with Walter Afanasieff. Columbia Records released it on November 1, 1994, as the lead single from her first holiday album and fourth studio album, Merry Christmas.`` Christmas'' is an uptempo love song that includes bell chimes and heavy back - up vocals, as well as use of synthesizers.\n\nTitle: Parable of the Prodigal Son\nThe Parable of the Prodigal Son (also known as the Two Brothers, Lost Son, Loving Father, or Lovesick Father) is one of the parables of Jesus and appears in Luke 15: 11 -- 32. Jesus Christ shares it with his disciples, the Pharisees and others.\n\nTitle: Back to the Future (soundtrack)\n``The Washington Post ''- Composed by John Philip Sousa`` Mr. Sandman'' - Performed by The Four Aces ``The Ballad of Davy Crockett ''- Performed by Fess Parker`` Pledging My Love'' - Performed by Johnny Ace ``Out the Window ''- Performed by Edward Van Halen\n\nQuestion:\nWho is the father of the Heavy Seas of Love performer?\n\nAnswer:\n", "document_start_index": 258, "document_end_index": 7895, "query_start_index": 7897, "query_end_index": 7961, "truncation_seperator": "... [The rest of the paragraphs are omitted]\n\n", "output": null, "inner_docs_start_indices": [258, 502, 828, 1286, 1659, 1810, 2413, 2705, 3056, 3418, 4015, 4198, 4601, 4783, 5008, 5680, 6523, 6844, 7318, 7599]},
{"id": "2hop__28411_84813", "pid": "2hop__28411_84813", "input": "You are given several paragraphs from Wikipedia and a question. Answer the question as concisely as you can, using a single phrase if possible. If the question cannot be answered based on the information in the paragraphs, write \"unanswerable\".\n\nParagraphs:\nTitle: Personnel recovery\nThe United States Armed Forces defines personnel recovery as ``The sum of military, DOD civilian, DOD contractor personnel, or other personnel designated by the President or Secretary of Defense, who are isolated, missing, detained, or captured (IMDC) in an operational environment. Also called PR. ''The Joint Personnel Recovery Agency is the Chairman's Controlled Activity and is designated as DoD's office of primary responsibility for DoD - wide personnel recovery (PR) matters, less policy.\n\nTitle: Philip Giraldi\nPhilip Giraldi (born c. 1946) is a former counter-terrorism specialist and military intelligence officer of the United States Central Intelligence Agency (CIA) and a columnist and television commentator who is the Executive Director of the Council for the National Interest.. As an author and analyst, Giraldi writes a regular column for the alternative media outlet Unz Review. He is especially controversial for the many articles he has written denouncing Judaism and Jews whom he has compared to \"a bottle of rat poison\" and for his denial of the Nazi Holocaust.\n\nTitle: United States Department of Defense\nUnited States Department of Defense Department overview Formed September 18, 1947; 70 years ago (1947 - 09 - 18) (as National Military Establishment) Preceding Department U.S. Department of War U.S. Department of the Navy Type Executive Department Headquarters The Pentagon Arlington County, Virginia, US 38 ° 52 ′ 16 ''N 77 ° 3 ′ 21'' W ﻿ / ﻿ 38.87111 ° N 77.05583 ° W ﻿ / 38.87111; - 77.05583 Coordinates: 38 ° 52 ′ 16 ''N 77 ° 3 ′ 21'' W ﻿ / ﻿ 38.87111 ° N 77.05583 ° W ﻿ / 38.87111; - 77.05583 Employees 742,000 (civilian) 1,300,000 (active duty military) 826,000 (National Guard and reserve): 2.87 million total (2016) Annual budget US $530.1 billion (2010) US $549.1 billion (2011) US $553.0 billion (est. 2012) US $496.1 billion (2015) US $534.3 billion (base FY2016) Department executives James Mattis, Secretary Patrick M. Shanahan, Deputy Secretary Child agencies U.S. Department of the Army U.S. Department of the Navy U.S. Department of the Air Force Website www.defense.gov\n\nTitle: Guinea-Bissau\nEducation is compulsory from the age of 7 to 13. The enrollment of boys is higher than that of girls. In 1998, the gross primary enrollment rate was 53.5%, with higher enrollment ratio for males (67.7%) compared to females (40%).\n\nTitle: 1923 Daimler Airway de Havilland DH.34 crash\nThe 1923 Daimler Airway de Havilland DH.34 crash occurred on 14 September 1923 when a de Havilland DH.34 of Daimler Airway operating a scheduled domestic passenger flight from Croydon to Manchester crashed at Ivinghoe, Buckinghamshire, England, killing all five people on board.\n\nTitle: Combat Zones That See\nCombat Zones That See, or CTS, is a project of the United States Defense Advanced Research Projects Agency (DARPA) whose goal is to \"track everything that moves\" in a city by linking up a massive network of surveillance cameras to a centralised computer system. Artificial intelligence software will then identify and track all movement throughout the city.\n\nTitle: United States Department of Homeland Security\nUnited States Department of Homeland Security Seal of the U.S. Department of Homeland Security Flag of the U.S. Department of Homeland Security Nebraska Avenue Complex, DHS headquarters Agency overview Formed November 25, 2002; 15 years ago (2002 - 11 - 25) Jurisdiction United States Headquarters Nebraska Avenue Complex, Washington, D.C., U.S. 38 ° 56 ′ 17 ''N 77 ° 4 ′ 56'' W ﻿ / ﻿ 38.93806 ° N 77.08222 ° W ﻿ / 38.93806; - 77.08222 Employees 229,000 (2017) Annual budget $40.6 billion (2017) Agency executives Kirstjen Nielsen, Secretary Elaine Duke, Deputy Secretary Child agencies United States Citizenship and Immigration Services U.S. Customs and Border Protection Federal Emergency Management Agency U.S. Immigration and Customs Enforcement Transportation Security Administration United States Coast Guard National Protection and Programs Directorate United States Secret Service Federal Law Enforcement Training Center Citizenship & Immigration Services Ombudsmen Domestic Nuclear Detection Office Management Directorate Office for Civil Rights & Civil Liberties Office of General Counsel Office of Health Affairs Office of Intelligence & Analysis Office of Legislative Affairs Office of Operations Coordination Office of Partnership & Engagement Office of Policy Office of Public Affairs Office of the Inspector General Privacy Office Science & Technology Directorate Website www.dhs.gov ``The DHS March ''\n\nTitle: Hillsborough County Sheriff's Office (Florida)\nHillsborough County Sheriff's Office (HCSO) is the primary law enforcement agency for Hillsborough County, Florida and is responsible for law enforcement services for the of unincorporated areas of the county as well as operation of the two jail facilities, a work release center, and provides courthouse security for the 13th Judicial Circuit. Each of the three incorporated cities (Tampa, Plant City, and Temple Terrace) has its own police agency. Tampa International Airport, and the University of South Florida also have independent police agencies.\n\nTitle: OPEC Fund for International Development\nOFID played a significant role in the establishment of IFAD, channeling US$861.1 million in contributions from OPEC member countries towards the agency’s initial capital and first replenishment. Since IFAD's creation, OPEC member states have maintained their firm support of the agency, contributing to additional replenishments of its resources. In addition, OFID itself has given a further US$20 million as a special contribution from its own resources.\n\nTitle: War on Terror\nIn addition to military efforts abroad, in the aftermath of 9/11 the Bush Administration increased domestic efforts to prevent future attacks. Various government bureaucracies that handled security and military functions were reorganized. A new cabinet-level agency called the United States Department of Homeland Security was created in November 2002 to lead and coordinate the largest reorganization of the U.S. federal government since the consolidation of the armed forces into the Department of Defense.[citation needed]\n\nTitle: Space Race\nOn April 2, 1958, President Eisenhower reacted to the Soviet space lead in launching the first satellite, by recommending to the US Congress that a civilian agency be established to direct nonmilitary space activities. Congress, led by Senate Majority Leader Lyndon B. Johnson, responded by passing the National Aeronautics and Space Act, which Eisenhower signed into law on July 29, 1958. This law turned the National Advisory Committee on Aeronautics into the National Aeronautics and Space Administration (NASA). It also created a Civilian-Military Liaison Committee, chaired by the President, responsible for coordinating the nation's civilian and military space programs.\n\nTitle: 1958 Channel Airways de Havilland DH.104 Dove crash\nThe 1958 Channel Airways de Havilland DH.104 Dove crash occurred on 15 January 1958, when a de Havilland DH.104 Dove of Channel Airways crashed on approach to Ferryfield Airport, Lydd, Kent due to mismanagement of the aircraft's fuel system by the pilot. All seven people on board survived, but the aircraft was written off.\n\nTitle: Emergency management\nIn the United States, all disasters are initially local, with local authorities, with usually a police, fire, or EMS agency, taking charge. Many local municipalities may also have a separate dedicated office of emergency management (OEM), along with personnel and equipment. If the event becomes overwhelming to the local government, state emergency management (the primary government structure of the United States) becomes the controlling emergency management agency. Federal Emergency Management Agency (FEMA), part of the Department of Homeland Security (DHS), is the lead federal agency for emergency management. The United States and its territories are broken down into ten regions for FEMA's emergency management purposes. FEMA supports, but does not override, state authority.\n\nTitle: Gamal Abdel Nasser\nFollowing Syria's secession, Nasser grew concerned with Amer's inability to train and modernize the army, and with the state within a state Amer had created in the military command and intelligence apparatus. In late 1961, Nasser established the Presidential Council and decreed it the authority to approve all senior military appointments, instead of leaving this responsibility solely to Amer. Moreover, he instructed that the primary criterion for promotion should be merit and not personal loyalties. Nasser retracted the initiative after Amer's allies in the officers corps threatened to mobilize against him.\n\nTitle: United States Department of Homeland Security\nWhereas the Department of Defense is charged with military actions abroad, the Department of Homeland Security works in the civilian sphere to protect the United States within, at, and outside its borders. Its stated goal is to prepare for, prevent, and respond to domestic emergencies, particularly terrorism. On March 1, 2003, DHS absorbed the Immigration and Naturalization Service (INS) and assumed its duties. In doing so, it divided the enforcement and services functions into two separate and new agencies: Immigration and Customs Enforcement and Citizenship and Immigration Services. The investigative divisions and intelligence gathering units of the INS and Customs Service were merged forming Homeland Security Investigations. Additionally, the border enforcement functions of the INS, including the U.S. Border Patrol, the U.S. Customs Service, and the Animal and Plant Health Inspection Service were consolidated into a new agency under DHS: U.S. Customs and Border Protection. The Federal Protective Service falls under the National Protection and Programs Directorate.\n\nTitle: Central Intelligence Agency\nThe closest links of the U.S. IC to other foreign intelligence agencies are to Anglophone countries: Australia, Canada, New Zealand, and the United Kingdom. There is a special communications marking that signals that intelligence-related messages can be shared with these four countries. An indication of the United States' close operational cooperation is the creation of a new message distribution label within the main U.S. military communications network. Previously, the marking of NOFORN (i.e., No Foreign Nationals) required the originator to specify which, if any, non-U.S. countries could receive the information. A new handling caveat, USA/AUS/CAN/GBR/NZL Five Eyes, used primarily on intelligence messages, gives an easier way to indicate that the material can be shared with Australia, Canada, United Kingdom, and New Zealand.\n\nTitle: Ceres (dwarf planet)\nCeres follows an orbit between Mars and Jupiter, within the asteroid belt, with a period of 4.6 Earth years. The orbit is moderately inclined (i = 10.6 ° compared to 7 ° for Mercury and 17 ° for Pluto) and moderately eccentric (e = 0.08 compared to 0.09 for Mars).\n\nTitle: Sound barrier\nMeanwhile, test pilots achieved high velocities in the tailless, swept - wing de Havilland DH 108. One of them was Geoffrey de Havilland, Jr. who was killed on 27 September 1946 when his DH 108 broke up at about Mach 0.9. John Derry has been called ``Britain's first supersonic pilot ''because of a dive he made in a DH 108 on 6 September 1948.\n\nTitle: Army of Northern Virginia\nThe Army of Northern Virginia was the primary military force of the Confederate States of America in the Eastern Theater of the American Civil War. It was also the primary command structure of the Department of Northern Virginia. It was most often arrayed against the Union Army of the Potomac.\n\nTitle: Schmidt Artist Lofts\nThe Schmidt Artist Lofts, located in the West Seventh neighborhood of Saint Paul, Minnesota, United States, was originally built to brew beer for Schmidt Brewery. The Schmidt Brewery was vacant for 11 years until a massive community and developer effort resulted in a plan for a revitalization of the brewery's historic building into the creation of the Schmidt Artist Lofts in 2013.\n\nQuestion:\nWho is the primary military leader within the massive agency that DHS was compared to?\n\nAnswer:\n", "document_start_index": 258, "document_end_index": 12458, "query_start_index": 12460, "query_end_index": 12556, "truncation_seperator": "... [The rest of the paragraphs are omitted]\n\n", "output": null, "inner_docs_start_indices": [258, 781, 1370, 2401, 2653, 2985, 3373, 4845, 5454, 5958, 6506, 7202, 7587, 8402, 9044, 10182, 11057, 11351, 11718, 12047]},
{"id": "2hop__83154_13021", "pid": "2hop__83154_13021", "input": "You are given several paragraphs from Wikipedia and a question. Answer the question as concisely as you can, using a single phrase if possible. If the question cannot be answered based on the information in the paragraphs, write \"unanswerable\".\n\nParagraphs:\nTitle: Battle of Lemo\nThe Battle of Lemo was fought during the Finnish War between Sweden and Russia on 19–20 June 1808 (Julian calendar 7–8 June).\n\nTitle: 21st century\nThe 21st century is the current century of the Anno Domini era, in accordance with the Gregorian calendar. It began on January 1, 2001 and will end on December 31, 2100. It is the first century of the 3rd millennium. It is distinct from the century known as the 2000s which began on January 1, 2000 and will end on December 31, 2099.\n\nTitle: Stefan Štiljanović\nStefan Štiljanović (; fl. 1498 – 1543) was the last prominent Serbian nobleman of the period of Ottoman subjugation of Serbia, and according to folklore, he was the last Despot of Serbia. He ruled a large territory under the Hungarian crown, due to his famed operations against the Ottoman Empire in the frontiers. Štiljanović is venerated as a Saint in the Serbian Orthodox Church on the 4 October (Julian Calendar) or 17 October (Gregorian Calendar) which comes to the same thing.\n\nTitle: Draft lottery (1969)\nThe lottery numbers assigned in December 1969 were used during calendar year 1970 both to call for induction and to call for physical examination, a preliminary call covering more men.\n\nTitle: Trampolene\n\"Trampolene\" is a song by the English singer-songwriter Julian Cope. It is the second single released in support of his third album \"Saint Julian\".\n\nTitle: Terry and Julian\nTerry and Julian is a British sitcom that aired on Channel 4 in 1992. Starring Julian Clary, it was written by Clary, Paul Merton and John Henderson. The title is a spoof the title of the long-running BBC sitcom \"Terry and June\", whose star June Whitfield made a guest appearance in one episode of \"Terry and Julian\".\n\nTitle: Most Holy Name of the Blessed Virgin Mary\nThe Feast of the Most Holy Name of the Blessed Virgin Mary is an optional memorial celebrated in the liturgical calendar of the Catholic Church on 12 September. It has been a universal Roman Rite feast since 1684, when Pope Innocent XI included it in the General Roman Calendar to commemorate the victory at the Battle of Vienna in 1683. It was removed from the Church calendar in the liturgical reform following Vatican II but restored by Pope Saint John Paul II in 2002, along with the Feast of the Holy Name of Jesus.\n\nTitle: 3rd millennium\nThe 22nd century will be a century of the Anno Domini or Common Era in accordance with the Gregorian calendar. It will be the century following the current 21st century, beginning on January 1, 2101 and ending on December 31, 2200.\n\nTitle: Gregorian calendar\n\"Old Style\" (OS) and \"New Style\" (NS) are sometimes added to dates to identify which system is used in the British Empire and other countries that did not immediately change. Because the Calendar Act of 1750 altered the start of the year, and also aligned the British calendar with the Gregorian calendar, there is some confusion as to what these terms mean. They can indicate that the start of the Julian year has been adjusted to start on 1 January (NS) even though contemporary documents use a different start of year (OS); or to indicate that a date conforms to the Julian calendar (OS), formerly in use in many countries, rather than the Gregorian calendar (NS).\n\nTitle: Education in France\nIn Metropolitan France, the school year runs from early September to early July. The school calendar is standardised throughout the country and is the sole domain of the ministry.\n\nTitle: Battle of Lutter\nThe Battle of Lutter (Lutter am Barenberge) took place during the Thirty Years' War, on 27 August 1626 (17 August 1626 in the old Julian calendar), between the forces of the Lower Saxon Circle, combining mostly Protestant states, and led by its Circle Colonel Christian IV of Denmark, and the forces of the Catholic League. Lutter am Barenberge lies to the south of the modern town of Salzgitter, then within the Imperial Circle of Lower Saxony, and now in northwest Germany.\n\nTitle: Daylight saving time\nChanges to DST rules cause problems in existing computer installations. For example, the 2007 change to DST rules in North America required many computer systems to be upgraded, with the greatest impact on email and calendaring programs; the upgrades consumed a significant effort by corporate information technologists.\n\nTitle: Gregorian calendar\nThe Gregorian calendar is internationally the most widely used civil calendar. It is named after Pope Gregory XIII, who introduced it in October 1582.\n\nTitle: Julian calendar\nThe Julian calendar, proposed by Julius Caesar in 708 AUC (46 BC/BCE), was a reform of the Roman calendar. It took effect on 1 January 709 AUC (45 BC/BCE), by edict. It was the predominant calendar in the Roman world, most of Europe, and in European settlements in the Americas and elsewhere, until it was gradually replaced by the Gregorian calendar, promulgated in 1582 by Pope Gregory XIII.\n\nTitle: Computer\nMany mechanical aids to calculation and measurement were constructed for astronomical and navigation use. The planisphere was a star chart invented by Abū Rayhān al-Bīrūnī in the early 11th century. The astrolabe was invented in the Hellenistic world in either the 1st or 2nd centuries BC and is often attributed to Hipparchus. A combination of the planisphere and dioptra, the astrolabe was effectively an analog computer capable of working out several different kinds of problems in spherical astronomy. An astrolabe incorporating a mechanical calendar computer and gear-wheels was invented by Abi Bakr of Isfahan, Persia in 1235. Abū Rayhān al-Bīrūnī invented the first mechanical geared lunisolar calendar astrolabe, an early fixed-wired knowledge processing machine with a gear train and gear-wheels, circa 1000 AD.\n\nTitle: Daylight saving time\nThese limitations have caused problems. For example, before 2005, DST in Israel varied each year and was skipped some years. Windows 95 used rules correct for 1995 only, causing problems in later years. In Windows 98, Microsoft marked Israel as not having DST, forcing Israeli users to shift their computer clocks manually twice a year. The 2005 Israeli Daylight Saving Law established predictable rules using the Jewish calendar but Windows zone files could not represent the rules' dates in a year-independent way. Partial workarounds, which mishandled older time stamps, included manually switching zone files every year and a Microsoft tool that switches zones automatically. In 2013, Israel standardized its daylight saving time according to the Gregorian calendar.\n\nTitle: History of calendars\nThe Gregorian calendar was introduced as a refinement of the Julian calendar in 1582, and is today in worldwide use as the de facto calendar for secular purposes.\n\nTitle: Battle of Wittstock\nThe Battle of Wittstock took place during the Thirty Years' War (1618-1648). It was fought on 24 September (Julian calendar) or 4 October (Gregorian calendar) 1636. A Swedish-allied army commanded jointly by Johan Banér and Alexander Leslie, later 1st Earl of Leven decisively defeated a combined Imperial-Saxon army, led by Count Melchior von Hatzfeld and the Saxon Elector John George I.\n\nTitle: Computus\nComputus (Latin for ``computation '') is a calculation that determines the calendar date of Easter. Because the date is based on a calendar - dependent equinox rather than the astronomical one, there are differences between calculations done according to the Julian calendar and the modern Gregorian calendar. The name has been used for this procedure since the early Middle Ages, as it was considered the most important computation of the age.\n\nTitle: Jujhar Singh\nSahibzada Jujhar Singh (14 March 1691 – 22 December 1705), the second son of Guru Gobind Singh, was born to Mata Jito at Anandpur Sahib. This event is now celebrated on April 9 each year according to the Nanakshahi Calendar).\n\nQuestion:\nOn what day did both the Julian and Gregorian calendars add the significant annual event calculated off the Julian calendar?\n\nAnswer:\n", "document_start_index": 258, "document_end_index": 8127, "query_start_index": 8129, "query_end_index": 8263, "truncation_seperator": "... [The rest of the paragraphs are omitted]\n\n", "output": null, "inner_docs_start_indices": [258, 407, 762, 1272, 1486, 1653, 1996, 2567, 2822, 3517, 3725, 4226, 4576, 4754, 5172, 6010, 6810, 7002, 7420, 7882]},
{"id": "3hop1__116597_591997_60904", "pid": "3hop1__116597_591997_60904", "input": "You are given several paragraphs from Wikipedia and a question. Answer the question as concisely as you can, using a single phrase if possible. If the question cannot be answered based on the information in the paragraphs, write \"unanswerable\".\n\nParagraphs:\nTitle: Craig Hospital\nCraig Hospital is a Rehabilitation Hospital in Englewood, Colorado specializing in spinal cord injury (SCI) and Traumatic Brain Injury (TBI) rehabilitation.\n\nTitle: Golden West Lodge Historic District\nThe Golden West Lodge Historic District includes the Golden West Lodge (now the Golden West Visitor Center) and six log cabins around it in Stehekin, Washington. Built in 1926, the lodge used salvaged portions of the Field Hotel, demolished the same year when the level of Lake Chelan was raised. Located in Lake Chelan National Recreation Area, the lodge was rehabilitated to function as the National Park Service Stehekin District Headquarters and Visitor Center in 2002.\n\nTitle: Rehabilitation Act of 1973\nThe Rehabilitation Act of 1973, (Pub. L. 93 -- 112, 87 Stat. 355, enacted September 26, 1973), is a federal law, codified as 29 U.S.C. § 701 et seq. The principal sponsor of the bill was Rep. John Brademas (IN - 3). The Rehabilitation Act of 1973 replaces the Vocational Rehabilitation Act of 1973, to extend and revise the authorization of grants to States for vocational rehabilitation services, with special emphasis on services to those with the most severe disabilities, to expand special Federal responsibilities and research and training programs with respect to individuals with disabilities, to establish special responsibilities in the Secretary of Health, Education, and Welfare for coordination of all programs with respect to individuals with disabilities within the Department of Health, Education, and Welfare, and for other purposes.\n\nTitle: Mary E. Switzer\nMary Elizabeth Switzer (February 16, 1900 - October 16, 1971) was an American public administrator and social reformer. She is best remembered for her work on the 1954 Vocational Rehabilitation Act, which provided a great expansion of vocational rehabilitation service for people with disabilities. She publicized the government's growing role in vocational rehabilitation and encouraged expansion of vocational rehabilitation projects among non-governmental organizations.\n\nTitle: Mitchell Township, Davison County, South Dakota\nMitchell Township is a former township in Davison County, South Dakota, United States, now primarily overlaid by the city of Mitchell. Due in part to (1) rising road expenditures; (2 ) a declining tax base resulting from annexations of portions of Mitchell Township by the city of Mitchell, and (3) residents' unwillingness to increase their own property tax levy for road work, a majority of Mitchell Township residents affirmatively voted to abolish their political subdivision in 2001.\n\nTitle: The Rehabilitation Center at Hollywood Hills\nThe Rehabilitation Center at Hollywood Hills was a private nursing home located in Hollywood, Florida, United States with 152 beds. It was owned by Jack Michel and affiliated with Larkin Community Hospital. It was acquired by Hollywood Property Investments in 2015.\n\nTitle: A Cure for Wellness\nA Cure for Wellness is a 2016 psychological horror film directed by Gore Verbinski, written by Justin Haythe, and starring Dane DeHaan, Jason Isaacs, and Mia Goth. Its plot follows a young executive who is sent to retrieve a colleague from a mysterious rehabilitation center in the Swiss Alps.\n\nTitle: Komani Psychiatric Hospital\nKomani Psychiatric Hospital is a government funded psychiatric hospital and drug rehabilitation centre in Queenstown, Eastern Cape in South Africa.\n\nTitle: Leopold Lummerstorfer\nLeopold Lummerstorfer (born 1968 in Gramastetten, Austria) is an Austrian film director, author and producer. He resides in Vienna and near Kapuvár.\n\nTitle: Israel Sports Center for the Disabled\nThe Israel Sports Center for the Disabled (ISCD) is an Israeli institution operated by ILAN aimed at rehabilitation of the physically challenged.\n\nTitle: Goin' South\nGoin' South is a 1978 American western-comedy film, directed by and starring Jack Nicholson, with Mary Steenburgen, Christopher Lloyd, John Belushi, Richard Bradford, Veronica Cartwright, Danny DeVito and Ed Begley Jr.\n\nTitle: The Trip (1967 film)\nThe Trip (1967) is a counterculture-era psychedelic film released by American International Pictures, directed by Roger Corman, written by Jack Nicholson, and shot on location in and around Los Angeles, including on top of Kirkwood in Laurel Canyon, Hollywood Hills, and near Big Sur, California in 1967. Peter Fonda stars as a young television commercial director named Paul Groves.\n\nTitle: 3rd Okinawa International Movie Festival\nThe 3rd Okinawa International Movie Festival was held from March 18 to March 27, 2011 and took place at the Okinawa Convention Center in Ginowan City and Sakurazaka Theater in Naha, owned and run by Japanese director Yuji Nakae.\n\nTitle: OSF Saint Francis Medical Center\nOSF Saint Francis Medical Center, located in Peoria, Illinois, United States, is a teaching hospital for the University of Illinois College of Medicine at Peoria and part of the OSF Healthcare System. The Center, which is the largest hospital in the Peoria metropolitan area and in central Illinois, is designated by the state of Illinois as the Level I adult and pediatric regional trauma center for a 26-county region in mid-Illinois. OSF Saint Francis owns the Children's Hospital of Illinois (though the Hospital has its own President), the OSF Saint Francis Heart Hospital, the Illinois Neurological Institute, and the OSF Saint Francis Medical Center College of Nursing, which are all located either in or near the Medical Center. The hospital is a clinical training hospital for many medical students, interns, residents, and fellows of the Peoria campus of the University of Illinois College of Medicine.\n\nTitle: Judith E. Deutsch\nJudith E. Deutsch, PT, PhD, FAPTA, is a professor of physical therapy in the Department of Rehabilitation & Movement Sciences at Rutgers University. She is also the director of the Research in Virtual Environments and Rehabilitation Sciences Lab.\n\nTitle: Northeast Park, Minneapolis\nNortheast Park is a neighborhood in the Northeast community in Minneapolis, Minnesota. Its boundaries are 18th Avenue and New Brighton Boulevard to the north, the city limits to the northeast, Interstate 35W to the southeast, Broadway to the south, and Central Avenue to the west. The Quarry shopping center is located in this neighborhood. Northeast Athletic Field Park resides in the neighborhood with various baseball fields,\n\nTitle: Goin' Ape!\nGoin' Ape! is an album by American comedian, comedy writer and radio personality Jackie Martling. The album was released in 1980 on the Off Hour Rockers label.\n\nTitle: Christy Harvey\nChristy Harvey is the Director of Strategic Communications at the Center for American Progress. She was a regular guest on \"The Al Franken Show\". She also edits a free news website for the Center called Mic Check. She is a former research director at \"The Wall Street Journal\".\n\nTitle: Detroit\nWithin the city of Detroit, there are over a dozen major hospitals which include the Detroit Medical Center (DMC), Henry Ford Health System, St. John Health System, and the John D. Dingell VA Medical Center. The DMC, a regional Level I trauma center, consists of Detroit Receiving Hospital and University Health Center, Children's Hospital of Michigan, Harper University Hospital, Hutzel Women's Hospital, Kresge Eye Institute, Rehabilitation Institute of Michigan, Sinai-Grace Hospital, and the Karmanos Cancer Institute. The DMC has more than 2,000 licensed beds and 3,000 affiliated physicians. It is the largest private employer in the City of Detroit. The center is staffed by physicians from the Wayne State University School of Medicine, the largest single-campus medical school in the United States, and the United States' fourth largest medical school overall.\n\nTitle: David Xavier Cifu\nDavid Xavier Cifu (born July 17, 1962, New York City, New York) is an American physiatrist, researcher, and medical educator. He is the Associate Dean for Innovation and System Integration in the School of Medicine at Virginia Commonwealth University School of Medicine, the chairman and Herman J. Flax M.D. Professor of the Department of Physical Medicine and Rehabilitation (PM&R) at Virginia Commonwealth University (VCU) in Richmond, Virginia, staff physiatrist at the Hunter Holmes McGuire Veterans Administration Medical Center (HHM-VAMC), founding director of the VCU-Center for Rehabilitation Science and Engineering and senior TBI specialist in the Department of Veterans Affairs' Veterans Health Administration.\n\nQuestion:\nWho owns the rehabilitation center in the neighborhood of the director of Goin' South?\n\nAnswer:\n", "document_start_index": 258, "document_end_index": 8814, "query_start_index": 8816, "query_end_index": 8912, "truncation_seperator": "... [The rest of the paragraphs are omitted]\n\n", "output": null, "inner_docs_start_indices": [258, 438, 956, 1841, 2339, 2884, 3203, 3525, 3709, 3888, 4080, 4319, 4732, 5010, 5964, 6237, 6702, 6881, 7182, 8068]}]
